export const locationMap = {
  'sichuan': {
    date: '2025-05-01',
    year: 2025,
    month: 5,
    day: 1,
    nongLi: '乙巳年四月初四',
    location: '安岳县石羊镇家中',
    latitude: 29.923179,
    longitude: 105.624569,
  },
  "wuhan": {
    date: '2025-05-10',
    year: 2025,
    month: 5,
    day: 10,
    nongLi: '乙巳年四月十三',
    location: '诺亚喜事汇（临空港店）',
    latitude: 30.640082,
    longitude: 114.138508,
  }
}
const xyFriendMap = {
  'limin': {
    name: '李敏',
    ...locationMap['wuhan'],
    welcome: [
      "敏姐姐~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "如果你有时间，带着小太阳来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'wangjingjing': {
    name: '王晶晶',
    ...locationMap['wuhan'],
    welcome: [
      "晶晶姐~ 终于到我发邀请函啦",
      "2025 年 5 月 10 日，我要结婚咯！",
      "如果你有时间，和昌总一起来吃席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'liujin': {
    name: '刘晶',
    ...locationMap['wuhan'],
    welcome: [
      "可爱的刘晶晶同学，终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "我们既是工作上的好搭档也是每天互相打气的上班搭子，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'wanglimin': {
    name: '王丽敏',
    ...locationMap['wuhan'],
    welcome: [
      "亲爱的姐，",
      "感谢您一直对我工作和生活上的关心和照顾，",
      "今天告知您一个好消息，",
      "2025年5月10日我要结婚啦~",
      "良辰美景少不了您的锦上添花，",
      "大喜之日，诚挚盼望您能在百忙之中莅临现场，给予我们祝福。",
      "我和另一半小陈携手期待您的到来！",
    ],
  },
  'liaiqiong': {
    name: '李爱琼',
    ...locationMap['wuhan'],
    welcome: [
      "美丽的李爱琼同学，终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "我们既是工作上的好搭档也是生活中的贴心伙伴，",
      "有空的话和段总一起来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'zhangyu': {
    name: '张玉',
    ...locationMap['wuhan'],
    welcome: [
      "美丽的张玉同学，终于到我发邀请函啦！ ",
      "2025 年 5 月 10 日，我要结婚咯！",
      "我们既是工作上的战友也是共享生活妙招的伙伴，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'liwanting': {
    name: '力文婷',
    ...locationMap['wuhan'],
    welcome: [
      "美丽的力文婷同学，终于到我发邀请函啦！ ",
      "2025 年 5 月 10 日，我要结婚咯！",
      "我们既是工作上的战友也是共享生活妙招的伙伴，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'chenxianglian': {
    name: '陈香莲',
    ...locationMap['wuhan'],
    welcome: [
      "美丽的陈香莲同学，终于到我发邀请函啦！ ",
      "2025 年 5 月 10 日，我要结婚咯！",
      "我们既是工作上的战友也是共享生活妙招的伙伴，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'chenxiaoyan': {
    name: '陈小艳',
    ...locationMap['wuhan'],
    welcome: [
      "美丽的陈小艳同学，终于到我发邀请函啦！ ",
      "2025 年 5 月 10 日，我要结婚咯！",
      "我们既是工作上的战友也是共享生活妙招的伙伴，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'liuqian': {
    name: '刘倩',
    ...locationMap['wuhan'],
    welcome: [
      "美丽的刘倩同学，终于到我发邀请函啦！ ",
      "2025 年 5 月 10 日，我要结婚咯！",
      "我们既是工作上的战友也是共享生活妙招的伙伴，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'jianghan': {
    name: '蒋晗',
    ...locationMap['wuhan'],
    welcome: [
      "hello，蒋晗同学，终于到我发邀请函啦！ ",
      "2025 年 5 月 10 日，我要结婚咯！",
      "我们既是工作上的战友也是共享生活妙招的伙伴，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'wangju': {
    name: '汪菊',
    ...locationMap['wuhan'],
    welcome: [
      "美丽的汪菊同学，终于到我发邀请函啦！ ",
      "2025 年 5 月 10 日，我要结婚咯！",
      "我们既是工作上的战友也是共享生活妙招的伙伴，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'leilincui': {
    name: '雷琳萃',
    ...locationMap['wuhan'],
    welcome: [
      "美丽的雷琳萃同学，终于到我发邀请函啦！ ",
      "2025 年 5 月 10 日，我要结婚咯！",
      "我们既是工作上的战友也是共享生活妙招的伙伴，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'lxy': {
    name: '刘小鸭',
    ...locationMap['sichuan'],
    welcome: [
      "刘小鸭~ 终于到我发邀请函啦！",
      "2025 年 5 月 1 日，我要结婚咯！",
      "务必要来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'lx': {
    name: '廖总',
    ...locationMap['sichuan'],
    welcome: [
      "廖总~ 终于到我发邀请函啦！",
      "2025 年 5 月 1 日，我要结婚咯！",
      "作为见证我爱情的老友，务必要来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'zmz': {
    name: '明珠兮',
    ...locationMap['sichuan'],
    welcome: [
      "明珠兮~ 终于到我发邀请函啦！",
      "2025 年 5 月 1 日，我要结婚咯！",
      "作为见证我爱情的老友，务必要来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
}
const cbzFriendMap = {
  "xiaoya": {
    name: '肖亚',
    ...locationMap['wuhan'],
    welcome: [
      "亲爱的肖亚同学~ 准备好接受我的请柬了吗?",
      "2025 年 5 月 10 日，我要结婚咯！",
      "你来不来?",
      "不来我就没新娘了,呜呜呜~",
      "来?",
      "那就一起结个婚吧~"
    ],
  },
  'xieyu': {
    name: '谢老板',
    ...locationMap['wuhan'],
    welcome: [
      "谢老板~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "到现在我们认识已经快 16 年了。",
      "曾经青涩的少年如今已经成为老板。",
      "期待谢老板的因为爱情震撼全场~",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'lizehao': {
    name: '李泽昊',
    ...locationMap['wuhan'],
    welcome: [
      "李泽昊~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "你是那个随时能从兜里掏出糖的人，",
      "也是那个替我挡谢老板酒的人，",
      "我们每次都不醉不归，",
      "这次再聚，一定要把谢宇喝趴下！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'yangyalin': {
    name: '杨亚林',
    ...locationMap['wuhan'],
    welcome: [
      "亚林~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "每次想起你脑子里都回荡着一声声小本小本。",
      "毕业后各自忙于工作和生活，",
      "虽然我们联系不多，但是曾经的友情常在。",
      "如果你有时间，来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'yiliang': {
    name: '易亮',
    ...locationMap['wuhan'],
    welcome: [
      "易亮~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "还记得我们大学时一起通宵打游戏的日子，仿佛就在昨天。",
      "曾经青涩的少年如今已成国家公务员，",
      "务必开上你的公务员专用车来吃席啊！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'xuzheyu': {
    name: '徐哲宇',
    ...locationMap['wuhan'],
    welcome: [
      "帅气的徐博士~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "还记得我们大学时一起通宵打游戏的日子，仿佛就在昨天。",
      "曾经那个青涩少年，如今成了健身达人，越来越帅！",
      "从不说脏话的人、给人一种温文尔雅(gay)的感觉，哈哈哈！",
      "务必带上嫂子来吃席啊~",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'yangzaiyao': {
    name: '杨仔耀',
    ...locationMap['wuhan'],
    welcome: [
      "仔耀~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "还记得我们大学时一起通宵打游戏的日子，仿佛就在昨天，",
      "曾经青涩的少年如今摇身一变成为股坛圣手，",
      "那就祝你早日回本吧（哈哈哈）~",
      "务必带上你对象（别说单身我不信）来吃席啊~",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  '林英杰': {
    name: '林英杰',
    ...locationMap['wuhan'],
    welcome: [
      "又高又帅气的英杰大佬~",
      "终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "一晃这么多年过去了，依旧怀念大学的美好时光，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'ligangxing': {
    name: '李港星',
    ...locationMap['wuhan'],
    welcome: [
      "港星~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "一晃这么多年过去了，依旧怀念大学的美好时光，",
      "曾经肆虐峡谷的 cbb，一手 VN 无人能敌，",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'liujiaming': {
    name: '刘家明',
    ...locationMap['wuhan'],
    welcome: [
      "家明~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "好久不见，甚是想念！",
      '还记得那次我们一起爬峨眉山, 住寺庙的日子，',
      '两天一夜，累到腿打颤颤，',
      '真怀念那时候啊~',
      '从高中同桌，到多年好友，',
      '你一直在我心里是那个什么都能聊的的老朋友。',
      '这次我人生的重要时刻，',
      "务必早点来，给你安排个有“技术含量”的节目",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'wuyunlong': {
    name: '吴云龙',
    ...locationMap['wuhan'],
    welcome: [
      "吴云龙~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "时间一晃，你娃都上小学了吧~",
      "怀念高中一起骑车上下学, 勇闯网吧召唤师峡谷的日子。",
      "务必带着嫂子和你娃来吃席啊！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  'chenxi': {
    name: '夕哥',
    ...locationMap['wuhan'],
    welcome: [
      "夕哥~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "转眼我俩离开派拉都快三年了，",
      "还记得刚进公司的时候，夕哥你对我的照顾和提携，真的让我感激不尽。",
      "跳槽前的叮嘱和教诲，后来一起搞钱的日子，",
      "点点滴滴，都是我人生中宝贵的记忆。",
      "人生难得贵人相助，",
      "有幸与你同行一程，满是温暖与鼓励。 ",
      "这次我的大日子，一定要带着嫂子一起来吃喜席啊！",
      "望我们，岁岁年年，同欢共乐！",
      "原谅我最近太忙没写我们的插件~"
    ],
  },
  'gongchen': {
    name: '龚臣',
    ...locationMap['wuhan'],
    welcome: [
      "龚老哥~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "怀念咱们零信任团队一起打拼的时光，",
      "很高兴你已经完成人生大事",
      "现在轮到我了~",
      "如果你有时间，带着嫂子来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！",
    ],
  },
  'guojie': {
    name: '杨国杰',
    ...locationMap['wuhan'],
    welcome: [
      "国杰~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "怀念咱们零信任团队一起打拼的时光，",
      "不善言辞的你在我眼里一直都是内心强大技术牛逼的大佬",
      "如果你有时间，带着嫂子和儿子来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！",
    ],
  },
  'gaoyu': {
    name: '高宇',
    ...locationMap['wuhan'],
    welcome: [
      "宇哥~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！",
    ],
  },
  'zhouzhaoyang': {
    name: '朝阳',
    ...locationMap['wuhan'],
    welcome: [
      "朝阳~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "一直以来你都是我们团队的老大哥，",
      "辛苦你啦！不仅各种事情安排的明明白白，",
      "还经常给我们带吃的，",
      "神仙同事不过如此！",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！",
    ],
  },
  'zhengxing': {
    name: '正兴',
    ...locationMap['wuhan'],
    welcome: [
      "正兴~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "有空的话来吃我的席呀！",
      "也很期待你的喜酒啊~",
      "望我们，岁岁年年，同欢共乐！",
    ],
  },
  'yuyi': {
    name: '余意',
    ...locationMap['wuhan'],
    welcome: [
      "余意~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！",
    ],
  },
  'xiaokang': {
    name: '效康',
    ...locationMap['wuhan'],
    welcome: [
      "效康~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！",
    ],
  },
  'zhiwei': {
    name: '智威',
    ...locationMap['wuhan'],
    welcome: [
      "智威~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "说起来也是缘分，咱们居然是一个高中的，那就算校友了~",
      "有空的话来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！",
    ],
  },
}
export const friendMap = {
  'default': {
    name: '默认',
    ...locationMap['wuhan'],
    welcome: [
      "朋友们~ 终于到我发邀请函啦！",
      "2025 年 5 月 10 日，我要结婚咯！",
      "如果你有时间，来吃我的席呀！",
      "望我们，岁岁年年，同欢共乐！"
    ],
  },
  ...xyFriendMap,
  ...cbzFriendMap
}

export const info = {
  woman: '肖亚',
  man: '陈本拯',
}